Taurus_Example.yml
---
execution:
  scenario: Demo
  concurrency: 1
  ramp-up: 1m
  hold-for: 1m
  server: 192.168.100.26
  port: 32781
scenarios:
  Demo:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.132 Safari/537.36'
      Upgrade-Insecure-Requests: '1'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8'
      Accept-Encoding: 'gzip, deflate'
      Accept-Language: 'fr-FR,fr;q=0.8,en-US;q=0.6,en;q=0.4'
      Host: '${server}:${port}'
      Referer: 'http://${server}:${port}/actions/Catalog.action'
    requests:
      - url: 'http://${server}:${port}/actions/Catalog.action'
        method: GET
        label: 'JPetStore Demo'
        headers: {}
reporting:
   - module: blazemeter
     test: Smoke Test